# Пользователь вводит месяц в виде целого числа от 1 до 12. 
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict

list_seasons = ("зима", "весна", "лето", "осень")

dict_seasons = {1:  "зима", 
                2:  "зима",
                3:  "весна", 
                4:  "весна",
                5:  "весна",
                6:  "лето",
                7:  "лето",
                8:  "лето",
                9:  "осень",
                10: "осень",
                11: "осень",
                12: "зима"}

num_month = int(input("Введите номер месяца от 1 до 12: "))

if 1 <= num_month <= 2 or num_month == 12:
    print(f"Используем список: {list_seasons[0]}")
if 3 <= num_month <= 5:
    print(f"Используем список: {list_seasons[1]}")
if 6 <= num_month <= 8:
    print(f"Используем список: {list_seasons[2]}")
if 9 <= num_month <= 11:
    print(f"Используем список: {list_seasons[3]}")

print(f"Используем словарь: {dict_seasons.get(num_month)}")

